degrees-backend/app/controllers/connections_controller.rb

  def show
    @user1 = User.find_by(name:params[:user1]).userid
---
SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "Sonam"], ["LIMIT", 1]]